src/cf/Catalogs/ПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПодключаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УстройствоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключенияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДрайверОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрайверыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФорматноЛогическогоКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеРасхождениеФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПереустановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУстановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическаяФискализация</Name>
					<Comment>Автоматическая фискализация чеков из очереди чеков</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяФН36</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьОтраслевыеРеквизиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВерсияФорматаОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбработчикДрайвера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификаторWebСервисОборудования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОграничениеДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПользовательБПО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРегистрации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ОборудованиеПоОрганизациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОборудованиеПоОрганизациям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УзелОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСПодключаемымОборудованиемOffline</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправляет1СSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправляет1СEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаполнятьКонтактныеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкиСистемыНалогообложенияПроверены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектронныеСертификатыНСПК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПечататьЧек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправлятьEMail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправлятьSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОфлайнОборудование</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
					<Comment>ОСН</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
					<Comment>УСН</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсобыйПорядок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрофессиональныйДоход</Name>
					<Comment>НПД</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АУСН</Name>
					<Comment>Автоматизированная УСН</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПодключаемоеОборудование/Forms/ПроверкаСНОДляККТ/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторУстройстваККТ = Параметры.ИдентификаторУстройстваККТ;
	КодыСистемыНалогообложения = Параметры.ПараметрыРегистрации.КодыСистемыНалогообложения;
	
	ПараметрыККТ = ПараметрыККТ(ИдентификаторУстройстваККТ);
	Организация = ПараметрыККТ.Организация;
	
	ЭтоПолноправныйПользователь = ПравоДоступа("Изменение", Метаданные.Справочники.ПодключаемоеОборудование);
	
	Отказ = НЕ ПараметрыККТ.ПроверятьСНО;
	
	ЕстьДоступныеСНО = Ложь;
	Если НЕ Отказ Тогда
		СписокРасхожденийСНО = СписокРасхожденийСНО(Организация, ИдентификаторУстройстваККТ, КодыСистемыНалогообложения, ЕстьДоступныеСНО);
		Отказ = (СписокРасхожденийСНО.Количество() = 0);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ПодготовитьФорму(СписокРасхожденийСНО, ЕстьДоступныеСНО);
	КонецЕсли; 
	
	КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Оповестить(КассовыеСменыКлиентБП.СобытиеВыполняетсяОперацияКассовойСмены());
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если НЕ ЗавершениеРаботы Тогда
		Оповестить(КассовыеСменыКлиентБП.СобытиеЗавершиласьОперацияКассовойСмены());
	КонецЕсли; 
КонецПроцедуры



#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиКНастройками(Команда)
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
	ПараметрыОперации.Кассир = КассовыеСменыВызовСервераБП.ПредставлениеКассира(Организация);
	ПараметрыОперации.КассирИНН = КассовыеСменыВызовСервераБП.ИННКассира(Организация);
	
	Если ЭтоПолноправныйПользователь Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПерейтиКНастройкамЗавершение", ЭтотОбъект);
	Иначе
		ОповещениеОЗавершении = Новый ОписаниеОповещения("НастройкаОборудованияЗавершение", ЭтотОбъект);
	КонецЕсли; 
	
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(ОповещениеОЗавершении, УникальныйИдентификатор, ИдентификаторУстройстваККТ, ПараметрыОперации);
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОткрытиеСмены(Команда)
	УстановитьПризнакБольшеНеСпрашивать(ИдентификаторУстройстваККТ);
	Закрыть();
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПерейтиКНастройкамЗавершение(Параметр, ДополнительныеПараметры) Экспорт
	ОповещениеОЗавершении = Новый ОписаниеОповещения("НастройкаОборудованияЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ИдентификаторУстройстваККТ);
	
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.ФормаОбъекта", ПараметрыФормы,,,,,ОповещениеОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОборудованияЗавершение(Параметр, ДополнительныеПараметры) Экспорт
	Оповестить("ИзменениеСтатусаКассовойСмены");
	
	Закрыть();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПризнакБольшеНеСпрашивать(ИдентификаторУстройстваККТ)
	МенеджерЗаписи = РегистрыСведений.ОборудованиеПоОрганизациям.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Оборудование = ИдентификаторУстройстваККТ;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.НастройкиСистемыНалогообложенияПроверены = Истина;
		
		УстановитьПривилегированныйРежим(Истина);
		МенеджерЗаписи.Записать();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФорму(СписокРасхождений, ЕстьДоступныеСНО)
	
	ШрифтПолужирный = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,,Истина);
	
	СписокФорматированнаяСтрока = Новый Массив;
	СписокФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'На этой кассе нельзя пробивать чеки по '"), ШрифтыСтиля.ОбычныйШрифтТекста));
	СписокФорматированнаяСтрока.Добавить(НОвый ФорматированнаяСтрока(СтрСоединить(СписокРасхождений, " и "),                 ШрифтПолужирный));
	СписокФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '.'"),                                       ШрифтыСтиля.ОбычныйШрифтТекста));
	СписокФорматированнаяСтрока.Добавить(Символы.ПС);
	СписокФорматированнаяСтрока.Добавить(Символы.ПС);

	Если ЕстьДоступныеСНО Тогда
		СписокФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Возможно, '"),                          ШрифтыСтиля.ОбычныйШрифтТекста));
	Иначе
		СписокФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Для продолжения работы '"),             ШрифтыСтиля.ОбычныйШрифтТекста));
	КонецЕсли; 
	
	СписокФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'нужно настроить кассу.'"),                  ШрифтыСтиля.ОбычныйШрифтТекста));
	СписокФорматированнаяСтрока.Добавить(Символы.ПС);
	СписокФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Как это сделать?'"),                        ШрифтыСтиля.МелкийШрифтТекста,,,"https://its.1c.ru/db/kkt#content:183:buh30"));
	СписокФорматированнаяСтрока.Добавить(Символы.ПС);
	
	Если НЕ ЭтоПолноправныйПользователь Тогда
		СписокФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Обратитесь к сотруднику, ответственному за настройку онлайн кассы.'"), ШрифтыСтиля.ОбычныйШрифтТекста));
		Элементы.ФормаПерейтиКНастройкам.Заголовок = НСтр("ru = 'Завершить работу с кассой (закрыть смену)'");
	КонецЕсли;
	
	Элементы.Декорация1.Заголовок = Новый ФорматированнаяСтрока(СписокФорматированнаяСтрока);
	
	Элементы.ФормПробиватьНеТребуется.Видимость = ЕстьДоступныеСНО;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокРасхожденийСНО(Организация, ИдентификаторУстройстваККТ, КодыСНОККТ, ЕстьДоступныеСНО)
	ТекущаяДата = ТекущаяДатаСеанса();
	
	МассивСНОККТ = СтрРазделить(КодыСНОККТ, ",", Ложь);
	СписокРасхождений = Новый Массив;
	
	СистемаНалогообложения = УчетнаяПолитика.СистемаНалогообложения(Организация, ТекущаяДата);
	
	ЕстьДоступныеСНО = Ложь;
	Если СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая Тогда
		Если МассивСНОККТ.Найти("0") = Неопределено 
			И (МассивСНОККТ.Найти("3") = Неопределено ИЛИ НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдентификаторУстройстваККТ, "ИспользуетсяФН36")) Тогда
			
			СписокРасхождений.Добавить("общей системе налогообложения");
		Иначе
			ЕстьДоступныеСНО = Истина;
		КонецЕсли; 
	ИначеЕсли СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
		Если УчетнаяПолитика.ПрименяетсяУСНДоходы(Организация, ТекущаяДата) Тогда
			Если МассивСНОККТ.Найти("1") = Неопределено Тогда
				СписокРасхождений.Добавить("упрощенной системе налогообложения (доходы)");
			Иначе
				ЕстьДоступныеСНО = Истина;
			КонецЕсли; 
		ИначеЕсли УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы(Организация, ТекущаяДата) Тогда
			Если МассивСНОККТ.Найти("2") = Неопределено Тогда
				СписокРасхождений.Добавить("упрощенной системе налогообложения (доходы минус расходы)");
			Иначе
				ЕстьДоступныеСНО = Истина;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	Если УчетнаяПолитика.ПрименяетсяУСНПатент(Организация, ТекущаяДата) Тогда
		Если МассивСНОККТ.Найти("5") = Неопределено Тогда
			СписокРасхождений.Добавить("патенту");
		Иначе
			ЕстьДоступныеСНО = Истина;
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат СписокРасхождений;
КонецФункции
 
&НаСервере
Функция ПараметрыККТ(ОборудованиеСссылка)
	
	Результат = Новый Структура;
	Результат.Вставить("ПроверятьСНО", Ложь);
	Результат.Вставить("Организация", Справочники.Организации.ПустаяСсылка());

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОборудованиеСсылка", ОборудованиеСссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОборудованиеПоОрганизациям.НастройкиСистемыНалогообложенияПроверены = ЛОЖЬ КАК ПроверятьСНО,
	|	ОборудованиеПоОрганизациям.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.ОборудованиеПоОрганизациям КАК ОборудованиеПоОрганизациям
	|ГДЕ
	|	ОборудованиеПоОрганизациям.Оборудование = &ОборудованиеСсылка";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции 

#КонецОбласти
